{
    "CSC.T254": "機械学習機械学習機械学習機械学習機械学習機械学習機械学習機械学習は「明示的にプログラミングすることなく，コンピュータに学ぶ能力を与えようとする研究分野」（アーサー・サミュエル，1959年）として出発した．理論やアルゴリズムの成熟，データの大規模化，計算能力の向上などを背景として，機械学習は飛躍的な進展を見せ，情報科学以外の分野でも活用されるようになった．本講義では，機械学習の基礎的な概念と理論を紹介し，機械学習の応用に従事するために必要な知識の習得を目指す．機械学習の応用例をコンピュータ・プログラムとして実装するスキルを養成するため，プログラミング言語Pythonによる演習も実施する．・機械学習の基礎的な概念・理解を習得する・機械学習の理論やアルゴリズムを実装を通して理解する・データ処理の基礎事項を習得する回帰回帰回帰回帰回帰分類分類分類分類分類クラスタリングクラスタリングクラスタリングクラスタリングクラスタリング次元圧縮次元圧縮次元圧縮次元圧縮次元圧縮強化学習強化学習強化学習強化学習強化学習確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学人工知能人工知能人工知能人工知能人工知能手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展パターン認識パターン認識パターン認識パターン認識パターン認識先端機械学習先端機械学習先端機械学習先端機械学習先端機械学習導入，Pythonの基礎機械学習の概要，Pythonの基本的な文法データの可視化データの読み書き，線グラフ，棒グラフ，散布図，ヒートマップ線形回帰最小二乗法，最尤推定，勾配法，評価，過学習，正則化線形分類（１）しきい値論理ユニット，二値分類，パーセプトロン，ロジスティック回帰，評価線形分類（２）多値分類，ソフトマックス関数演習1第3～5回の内容に関する演習深層ニューラルネットワーク (1)活性化関数，計算グラフ，自動微分，誤差逆伝搬深層ニューラルネットワーク (2)畳み込みニューラルネットワーク，ドロップアウト，ミニバッチ最適化サポートベクトルマシンマージン，双対性，サポートベクトル，カーネル関数，多値分類演習2第7～9回の内容に関する演習クラスタリング階層型クラスタリング，K-means次元圧縮主成分分析，特異値分解，ランダムプロジェクション強化学習マルコフ決定過程，ベルマン方程式，価値反復法，方策反復法，Q学習演習3第11～13回の内容に関する演習",
    "CSC.T271": "データ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズム本講義では，アルゴリズムとデータ構造の基本を学ぶ．前半では基本的なデータ構造とそのデータ構造を操作するアルゴリズム，後半ではより高度なアルゴリズムについて学ぶ．本講義を履修することにより以下を修得する．(1) 計算機科学の基礎となるデータ構造とアルゴリズムに関する知識(2) 上のデータ構造とアルゴリズムのCによる実装(3) 各アルゴリズムの効率に関する知識リストリストリストリストリストスタックスタックスタックスタックスタック木木木木木２分木２分木２分木２分木２分木グラフグラフグラフグラフグラフソートソートソートソートソート分割統治法分割統治法分割統治法分割統治法分割統治法動的計画法動的計画法動的計画法動的計画法動的計画法文字列照合文字列照合文字列照合文字列照合文字列照合情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展コンピュータサイエンス第一コンピュータサイエンス第一コンピュータサイエンス第一コンピュータサイエンス第一コンピュータサイエンス第一コンピュータサイエンス第二コンピュータサイエンス第二コンピュータサイエンス第二コンピュータサイエンス第二コンピュータサイエンス第二イントロダクションアルゴリズムとはなにかについて学ぶを学ぶ抽象データ型，計算効率抽象データ型、計算効率について学ぶ基本的なデータ構造：リスト，スタック，待ち行列リスト、スタック、待ち行列について学ぶ基本的なデータ構造：グラフ，木と２分木グラフ、木、2分木を理解する基本的なデータ構造：辞書とハッシュ辞書とハッシュについて学ぶ順序付き集合の処理：ヒープ，２分探索木，平衡探索木順序付き集合について学ぶ中間試験整列のアルゴリズム：バブルソート，挿入ソート，選択ソート整列アルゴリズムを学ぶ整列のアルゴリズム：ヒープソート、マージソート、クイックソート整列アルゴリズムを学ぶグラフアルゴリズム: グラフのデータ構造，深さ優先探索，幅優先探索グラフアルゴリズムについて学ぶグラフアルゴリズム：最短経路（Dijkstra, Floyd-Warshall)，最小全域木(Kruskal, Prim)グラフアルゴリズムについて学ぶ文字列の照合文字列照合のアルゴリズムについて知る高度な問題に対するアルゴリズム高度な問題に対するアルゴリズムを学ぶ期末試験",
    "CSC.T273": "オブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミング本講義では，オブジェクト指向プログラミングについて，その基本的な考え方やその原理となっている計算のメカニズムについて説明する．保守性と再利用性の向上につながるオブジェクト指向言語の特徴と設計原則について学ぶ．プログラミング言語としてJava言語を用いたプログラミング演習を通じて，階層化されたクラス定義による抽象化とプログラミング技法を利用する能力を身につけることを目指す．本講義を履修することによって以下の能力を修得する.(1) オブジェクト指向のプログラムが書ける(2) 継承と委譲による保守性の高いプログラミングができる(3) Java言語の基本的な文法を身に付ける．(4) Java言語の代表的なAPIを利用できる．クラスとオブジェクトクラスとオブジェクトクラスとオブジェクトクラスとオブジェクトクラスとオブジェクト継承継承継承継承継承多態性多態性多態性多態性多態性動的束縛動的束縛動的束縛動的束縛動的束縛カプセル化カプセル化カプセル化カプセル化カプセル化委譲委譲委譲委譲委譲手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論導入，オブジェクト指向とオブジェクト指向プログラミング言語オブジェクト指向とオブジェクト指向プログラミング言語の特徴について説明できるようになる．Java言語の特徴と処理系, 基本的な文法Java言語の特徴と処理系, 基本的な文法を説明できるようになる演習：Java言語の基本的な文法と基本APIJava言語の基本的な文法と基本APIを利用して簡単なプログラムを書くことができるオブジェクト指向言語の特徴(1)：カプセル化，継承，多重継承と単一継承カプセル化，継承，多重継承と単一継承を説明できる．演習：カプセル化，継承カプセル化，継承を利用した簡単なプログラムを書くことができるオブジェクト指向言語の特徴(2)：多態性，抽象クラス，委譲多態性，抽象クラス，委譲を説明できる演習：多態性多態性，抽象クラス，委譲を利用した簡単なプログラムを書くことができるモジュール化と機能独立性モジュール化と機能独立性を説明できるSOLID原則SOLID原則を説明できる演習：SOLID原則SOLID原則を考慮してプログラムを書くことができるJava API (入出力，文字列操作)入出力，文字列操作に関する主要なJava APIの機能を説明できる演習：Java API (入出力，文字列操作)Java API (入出力，文字列操作)を利用した簡単なプログラムを書くことができるJava API (Java Streaming API)Java Streaming APIの基本的な機能を説明できる演習：総合演習階層的なクラス定義に基づく抽象化を利用したプログラムを書くことができる．",
    "CSC.T262": "アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語はハードウェアに最も近いプログラミング言語である。機械語命令、バイナリ表現、基本的な計算機アーキテクチャなどを修得する。機械語命令、バイナリ表現、基本的な計算機アーキテクチャなどを修得する。機械語命令機械語命令機械語命令機械語命令機械語命令バイナリ表現バイナリ表現バイナリ表現バイナリ表現バイナリ表現基本的な計算機アーキテクチャ基本的な計算機アーキテクチャ基本的な計算機アーキテクチャ基本的な計算機アーキテクチャ基本的な計算機アーキテクチャコンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展システムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングイントロダクションイントロダクションアセンブリ言語の基本的な文法：機械語命令，アセンブリ命令，ラベル，コメントアセンブリ言語の基本的な文法：機械語命令，アセンブリ命令，ラベル，コメント命令とデータのバイナリ表現（１）：ニモニック，ラベル命令とデータのバイナリ表現（１）：ニモニック，ラベル命令とデータのバイナリ表現（２）：2の補数，バイトオーダ，アラインメント命令とデータのバイナリ表現（２）：2の補数，バイトオーダ，アラインメントCPU，レジスタ，メモリ，機械語命令，プログラムカウンタ，命令実行サイクルCPU，レジスタ，メモリ，機械語命令，プログラムカウンタ，命令実行サイクル機械語命令（１）：アドレッシングモード，データ転送機械語命令（１）：アドレッシングモード，データ転送機械語命令（２）：算術演算，論理演算，シフト演算機械語命令（２）：算術演算，論理演算，シフト演算機械語命令（３）：ジャンプ命令，フラグ，比較命令機械語命令（３）：ジャンプ命令，フラグ，比較命令機械語命令（４）：関数呼び出し，スタック，スタックレイアウト機械語命令（４）：関数呼び出し，スタック，スタックレイアウトC言語とのリンク，関数呼び出し規約C言語とのリンク，関数呼び出し規約インラインアセンブラインラインアセンブラバイナリ形式，ABI (application binary interface)バイナリ形式，ABI (application binary interface)リンク，再配置，記号表，記号解決リンク，再配置，記号表，記号解決特権命令，I/O命令，割り込み特権命令，I/O命令，割り込み",
    "CSC.T252": "論理回路理論論理回路理論論理回路理論論理回路理論論理回路理論論理回路理論論理回路理論ディジタル回路を設計・解析するための基礎理論である論理回路理論を修得する。情報工学分野において、コンピュータのハードウェアとソフトウェアが一つのシステムとして連続していることを理解することは非常に重要である。論理回路理論は、プロセッサに代表される高度なディジタル回路の設計や動作の理解の礎となる。コンピュータのハードウェアの動作を理解することは、ソフトウェアの動作の本質的な理解にも繋がる。具体的な講義項目は、論理回路理論である論理代数や論理関数とその性質、組合せ回路や順序回路の設計方法、ならびにハードウェア記述言語を利用したソフトウェアによるディジタル回路の記述手法等である。本講義の履修により、次の能力を修得する。・ディジタル回路の理解に必須な論理代数、論理関数の諸性質が理解できる。・組合せ回路や順序回路を理解でき、それらの設計ができる。・ハードウェア記述言語を利用してソフトウェア上でディジタル回路を記述できる。論理代数論理代数論理代数論理代数論理代数論理関数論理関数論理関数論理関数論理関数組合せ論理回路組合せ論理回路組合せ論理回路組合せ論理回路組合せ論理回路順序回路順序回路順序回路順序回路順序回路ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ論理代数、論理式、双対性論理代数、論理式、双対表現について理解する論理関数の包含関係と、極大項表現と極小項表現論理関数の包含関係ならびに極大項表現と極小項表現を理解するNAND形式、NOR形式、Reed-Muller展開NANDのみ、あるいはNORのみによる論理式の表現とReed-Muller展開を理解するユネイト関数、単調関数、双対関数ユネイト関数、単調関数、双対関数の性質を理解する対称関数、線形関数、閾値関数対称関数、線形関数ならびに閾値関数の性質を理解する組合せ回路の設計: カルノー図カルノー図を利用した組み合わせ回路の設計法を理解する組合せ回路の設計: Quine-McCluskey法Quine-McCluskey法による組合せ回路の設計法を理解するハードウェア記述言語による組合せ回路の記述ハードウェア記述言語による組合せ回路の記述法を理解する順序回路の構成順序回路の仕組みについて理解する状態遷移と状態割当て順序回路の状態遷移と状態の割当て法を理解するフリップフロップによる順序回路の設計フリップフロップを利用した順序回路の実現方法を理解する状態の等価性と順序回路の簡単化状態の等価性を利用した順序回路の簡単化を理解する状態の両立性と順序回路の簡単化状態の両立性を利用した順序回路の簡単化を理解するハードウェア記述言語による順序回路の記述ハードウェア記述言語による順序回路の記述法を理解する",
    "CSC.T242": "確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率と統計の基礎を講義する．とくに情報工学においてよく利用される確率や統計の手法の原理を理解し，各種計算法の習得をめざす．また，統計処理のための言語，環境であるRの使い方を学ぶ．1) 確率論の基礎を理解し、確率分布を適切に扱える2) 仮説検定の概念を理解し、適切な統計検定手法を選択、実行できるようになる確率論の諸概念（条件付き確率確率論の諸概念（条件付き確率確率論の諸概念（条件付き確率確率論の諸概念（条件付き確率確率論の諸概念（条件付き確率期待値期待値期待値期待値期待値分散）分散）分散）分散）分散）確率分布（二項分布確率分布（二項分布確率分布（二項分布確率分布（二項分布確率分布（二項分布正規分布）正規分布）正規分布）正規分布）正規分布）確率の法則（チェビシェフの不等式確率の法則（チェビシェフの不等式確率の法則（チェビシェフの不等式確率の法則（チェビシェフの不等式確率の法則（チェビシェフの不等式収束定理）収束定理）収束定理）収束定理）収束定理）統計的推定統計的推定統計的推定統計的推定統計的推定仮説検定仮説検定仮説検定仮説検定仮説検定t検定t検定t検定t検定t検定統計処理言語R統計処理言語R統計処理言語R統計処理言語R統計処理言語R人工知能人工知能人工知能人工知能人工知能パターン認識パターン認識パターン認識パターン認識パターン認識生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析導入，記述統計記述統計を理解する（平均，中央値，分散，標準偏差）相関，回帰データの関係を理解する（相関係数，線形回帰，最小二乗法）統計処理言語R入門Rによるデータ処理を理解する確率分布確率を理解する（確率の定義，確率分布）積率積率を理解する（分散，積率，積率母関数）確率不等式確率不等式を理解する（チェビシェフの不等式）離散型確率分布離散型確率分布を理解する(2項分布，ベルヌーイ分布，ポアソン分布，超幾何分布)\r\n連続型確率分布連続型確率分布を理解する（正規分布，一様分布，指数分布，ガンマ分布，ベータ分布）大数の法則と中心極限定理試行回数が増えると経験的確率と理論的確率が一致することを理解する（独立同一分布，大数の法則，中心極限定理）統計的推定統計的推定を理解する（標本分布，点推定，モーメント法，最尤法）仮説検定仮説検定を理解する(区間推定，仮説検定，有意水準，帰無仮説と対立仮説，第一種の過誤と第二種の過誤)\r\nt検定平均値の差の検定を理解する（スチューデントのt検定，ウェルチのt検定）カイ2乗検定カイ2乗検定を理解する(F検定，適合度のカイ2乗検定，独立性のカイ2乗検定)多重検定、高度な検定Bonferroni法、Familywise Error Rate、マン・ホイットニーのU検定\r\n",
    "CSC.T243": "手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎C言語による手続き型プログラミングの基礎的な内容について、講義と実習を通して理論と実践の両面から学びます。前半では、データ型、演算子、制御構造、関数、再帰などのＣ言語上の文法知識について、講義および練習問題の実習を通じて習得します。後半では、配列、ファイル入出力、文字型、文字列などを学ぶとともに、前半で習得した知識と併せて、データ探索や整列（ソーティング）などの具体的な問題を解くためのアルゴリズムを学びます。後半の実習では、大量データに対する統計処理や探索などを対象として、数回にわたって大規模なプログラムを作成します。(1) C言語のデータ型、標準入出力、演算子、制御構造、関数、再帰、配列、ファイル入出力、文字列について理解し、それらを活用したプログラムを作成できる。(2) 複数の探索アルゴリズムや整列アルゴリズムについて理解し、実現するプログラムを作成できる。(3) データ解析等の課題を解決するプログラムを作成し、解決法を説明できる。手続き型プログラミング手続き型プログラミング手続き型プログラミング手続き型プログラミング手続き型プログラミングデータ型データ型データ型データ型データ型標準入出力標準入出力標準入出力標準入出力標準入出力制御構造制御構造制御構造制御構造制御構造配列配列配列配列配列関数関数関数関数関数ファイル入出力ファイル入出力ファイル入出力ファイル入出力ファイル入出力再帰再帰再帰再帰再帰整列整列整列整列整列探索探索探索探索探索アルゴリズムアルゴリズムアルゴリズムアルゴリズムアルゴリズムデータ解析データ解析データ解析データ解析データ解析手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎オブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムデータ構造とアルゴリズムシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング数値計算法数値計算法数値計算法数値計算法数値計算法情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第二情報リテラシ第二情報リテラシ第二情報リテラシ第二情報リテラシ第二【講義】ハードウェア・ソフトウェア、整数型・実数型，演算子，標準入出力授業時間内に与えられる。【実習】手続き型プログラミングへの導入、実習環境の準備\r\n授業時間内に与えられる。【講義】制御構造（条件分岐、ループ）授業時間内に与えられる。【実習】ハードウェア・ソフトウェア、四則演算と標準入出力に関する実習授業時間内に与えられる。【講義】関数、再帰、変数のスコープ授業時間内に与えられる。【実習】制御構造に関する実習授業時間内に与えられる。【講義】配列、多次元配列、ファイル入出力授業時間内に与えられる。【実習】関数、再帰に関する実習授業時間内に与えられる。【実習】配列、多次元配列、ファイル入出力に関する実習授業時間内に与えられる。【講義】文字型、文字列授業時間内に与えられる。【実習】情報処理課題（基礎）に関するプログラム設計（統計処理、計測・制御等）授業時間内に与えられる。【講義】探索アルゴリズム・整列アルゴリズム授業時間内に与えられる。【実習】情報処理課題（基礎）に関するプログラム実装授業時間内に与えられる。習熟達成評価授業時間内に与えられる。",
    "CSC.T263": "関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎本講義では，手続き型プログラミング基礎・発展で学んだ手続き型プログラミングの考え方とは異なるプログラミングパラダイムに基づく関数型プログラミング言語について，その基本的な考え方やその原理となっている計算のメカニズムについて説明する．プログラミング言語としてはSchemeを用いる．解決しようとしている問題に応じて適切なプログラミングパラダイムを見極め，それに応じたプログラミング言語を用いてシステムを記述することは，システムの記述容易性，理解容易性，保守性などの観点から重要である．この講義では手続き型プログラミング基礎・発展と異なる観点から問題を捉えることにより，異なるプログラミングパラダイムに共通の概念や相違点を理解し，問題に応じて適切なプログラミング言語を利用する能力を身につけることを目指す．(1) 再帰プログラムが書ける(2) 関数型のプログラムが書ける(3) リスト処理のプログラムが書ける(4) 高階手続きが活用したプログラムが書ける手続き抽象手続き抽象手続き抽象手続き抽象手続き抽象可変データ構造可変データ構造可変データ構造可変データ構造可変データ構造ストリームストリームストリームストリームストリームリスト操作リスト操作リスト操作リスト操作リスト操作高階手続き高階手続き高階手続き高階手続き高階手続き継続継続継続継続継続計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展オブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングプログラミング言語の系譜，Scheme概説講義で指定する前回講義の内容に関するプログラミング実習講義で指定する再帰プログラム，名前のスコープ，高階手続き講義で指定する前回講義の内容に関するプログラミング実習講義で指定する合成データ，データ抽象講義で指定する前回講義の内容に関するプログラミング実習講義で指定するリスト処理 (変換・フィルタリング・畳み込み)講義で指定する前回講義の内容に関するプログラミング実習講義で指定する代入，閉包(クロージャ)講義で指定する前回講義の内容に関するプログラミング実習講義で指定する環境モデル講義で指定する遅延オブジェクト，ストリーム講義で指定する前回講義の内容に関するプログラミング実習講義で指定する継続講義で指定する",
    "CSC.T241": "計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論情報基礎学で学んだ基礎概念を基に，情報工学に関するより高度の概念や理論の基礎について講ずる。計算の原理，計算モデルを様々な角度から述べ，“計算”の本質を講義していく。チューリング機械，帰納的関数，λ計算，計算可能性の理論に関する初等的取り扱いができるようになる。チューリング機械チューリング機械チューリング機械チューリング機械チューリング機械帰納的関数帰納的関数帰納的関数帰納的関数帰納的関数λ計算λ計算λ計算λ計算λ計算計算可能性計算可能性計算可能性計算可能性計算可能性情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二チューリング機械１：チューリング機械とは各講義の後には，講義内容を復習すること．教科書の演習問題を活用するとよい．チューリング機械２：データの二進コード化講義中で指定する．チューリング機械３：万能チューリング機械講義中で指定する．チューリング機械４：計算可能性講義中で指定する．帰納的関数１：帰納的関数とは講義中で指定する．帰納的関数２：ゲーデル数によるデータの表現講義中で指定する．中間試験講義中で指定する．帰納的関数３：帰納的関数の計算可能性講義中で指定する．帰納的関数４：帰納的関数と計算可能性の等価性講義中で指定する．ラムダ計算１：ラムダ計算とは講義中で指定する．ラムダ計算２：ラムダ式によるデータの表現講義中で指定する．ラムダ計算３：ラムダ計算の計算可能性講義中で指定する．まとめ講義中で指定する．期末試験講義中で指定する．",
    "CSC.T251": "オートマトンと形式言語オートマトンと形式言語オートマトンと形式言語オートマトンと形式言語オートマトンと形式言語オートマトンと形式言語オートマトンと形式言語本講義では，プログラム言語処理・自然言語処理の基礎について論じ，句構造文法，正規表現，有限オートマトン，プッシュダウンオートマトン，形式言語の性質について講義する．形式言語について生成する手段と認識する機械の二つの観点から学ぶことにより，言語処理に関連する基礎理論を理解することをねらいとしている．本講義を履修することにより，以下の知識と能力を修得する．1) 正規言語と文脈自由言語の定義と性質を理解する．2) 正規文法と文脈自由文法について定義を理解し，標準形への変換等に関する問題を解くことができる．3) 決定性／非決定性有限オートマトンの定義を理解し，文法に対応するオートマトンを生成する問題などを解くことができる．4) プッシュダウンオートマトンの定義を理解し，関連するアルゴリズムに関する問題を解くことができる．句構造文法句構造文法句構造文法句構造文法句構造文法正規言語正規言語正規言語正規言語正規言語文脈自由言語文脈自由言語文脈自由言語文脈自由言語文脈自由言語正規文法正規文法正規文法正規文法正規文法文脈自由文法文脈自由文法文脈自由文法文脈自由文法文脈自由文法正規表現正規表現正規表現正規表現正規表現有限オートマトン有限オートマトン有限オートマトン有限オートマトン有限オートマトンプッシュダウン・オートマトンプッシュダウン・オートマトンプッシュダウン・オートマトンプッシュダウン・オートマトンプッシュダウン・オートマトン反復補題反復補題反復補題反復補題反復補題情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第一情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二情報基礎学第二計算基礎論計算基礎論計算基礎論計算基礎論計算基礎論コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成自然言語処理自然言語処理自然言語処理自然言語処理自然言語処理イントロダクション，句構造文法形式言語，句構造文法，列の導出正規文法正規文法，正規言語，正規言語の和集合・連接・クリーネ閉包，ε生成規則の除去有限オートマトンオートマトンの形式的定義，状態遷移図，決定性有限オートマトン(DFA)，非決定性有限オートマトン(NFA)正規文法と有限オートマトンNFAからDFAへの変換，NFAに対応する正規文法の導出ε遷移を含むオートマトンε遷移を含むオートマトン，ε遷移の除去，和集合・補集合・共通集合・連接・クリーネ閉包に対するNFA決定性有限オートマトンの最小化DFAの状態数最小化アルゴリズム，最小性の証明．一意性の証明正規言語の反復補題正規言語の反復補題，正規言語ではないことの証明法正規表現からオートマトンへの変換，オートマトンから正規表現への変換ボトムアップ法，トップダウン法，Kleeneの方法，再帰方程式を解く方法正規言語・有限オートマトンに関する復習，中間試験正規言語・有限オートマトンに関する復習と中間試験文脈自由文法(CFG)文脈自由文法，文脈自由言語，導出木，曖昧性，ε生成規則の除去チョムスキーの標準形チョムスキーの標準形(CNF)，単位生成規則の除去文脈自由言語(CFL)の反復補題，Ogdenの補題CNFに対する導出木，文脈自由言語の反復補題，Ogdenの補題，文脈自由言語ではないことの証明法(反復補題，Ogdenの補題による)非決定性プッシュダウンオートマトン(NPDA)，決定性プッシュダウンオートマトン(DPDA)非決定性プッシュダウンオートマトン（形式的定義，状態遷移図，受理する言語），時点表示，決定性プッシュダウンオートマトン，決定性文脈自由言語(DCFL)文脈自由文法とプッシュダウンオートマトンの等価性文脈自由文法に対応するNPDAの構成法，空スタックで受理する言語，NPDAに対応する文脈自由文法の生成法",
    "CSC.T272": "人工知能人工知能人工知能人工知能人工知能人工知能人工知能人工知能システムは様々な要素技術を用いて構築されます。本講義では，まず簡単な問題について，その定式化とそれに基づき探索する方法を学びます。次に，知識を明示的に表現し，その表現をもとに推論をする方法を学び，さらに効率的に推論するための計画作成の方法を習得します。最後に，コンピュータに知識を自動獲得させるための機械学習の手法を学びます。【到達目標】　情報社会において人間の知的生産作業を補助する人工知能システムの必要性を理解し，その構築の際に基本となる要素技術を身に付けることを到達目標とします。特に人間の知的生産作業のプロセスを表現する方法，その表現を用いて推論する方法を習得することを目標とします。【テーマ】 本講義では，人工知能システムを構築する上で必要な，探索，知識表現，推論，計画作成，機械学習の各々の分野における基本的な考え方を理解し，それを実世界に応用するために必要な基礎を築くことを目的とします。状態空間表現状態空間表現状態空間表現状態空間表現状態空間表現グラフサーチグラフサーチグラフサーチグラフサーチグラフサーチ発見的探索発見的探索発見的探索発見的探索発見的探索Ａ*探索Ａ*探索Ａ*探索Ａ*探索Ａ*探索ゲームゲームゲームゲームゲームミニマックス法ミニマックス法ミニマックス法ミニマックス法ミニマックス法α-β 手続α-β 手続α-β 手続α-β 手続α-β 手続意味ネットワーク意味ネットワーク意味ネットワーク意味ネットワーク意味ネットワークフレーム表現フレーム表現フレーム表現フレーム表現フレーム表現プロダクションシステムプロダクションシステムプロダクションシステムプロダクションシステムプロダクションシステム導出原理導出原理導出原理導出原理導出原理前向き推論前向き推論前向き推論前向き推論前向き推論後向き推論後向き推論後向き推論後向き推論後向き推論デフォルト推論デフォルト推論デフォルト推論デフォルト推論デフォルト推論確率的推論確率的推論確率的推論確率的推論確率的推論ベイジアンネットワークベイジアンネットワークベイジアンネットワークベイジアンネットワークベイジアンネットワークGPSGPSGPSGPSGPS階層的プランニング階層的プランニング階層的プランニング階層的プランニング階層的プランニング半順序プランニング半順序プランニング半順序プランニング半順序プランニング半順序プランニング即応プランニング即応プランニング即応プランニング即応プランニング即応プランニング線形識別器線形識別器線形識別器線形識別器線形識別器ニューラルネットワークニューラルネットワークニューラルネットワークニューラルネットワークニューラルネットワーク決定木決定木決定木決定木決定木パターン認識パターン認識パターン認識パターン認識パターン認識情報論理情報論理情報論理情報論理情報論理確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学人工知能入門講義で指定する。探索１：問題の表現とグラフ探索講義で指定する。探索２：発見的探索，Ａ*探索講義で指定する。探索３：ゲーム（ミニマックス法，α-β 手続）講義で指定する。知識表現１：意味ネットワーク，フレーム表現講義で指定する。知識表現２：プロダクションシステム講義で指定する。推論１：導出原理に基づく推論講義で指定する。推論２：前向き推論と後向き推論，デフォルト推論講義で指定する。推論３：確率的推論（ベイジアンネットワーク）講義で指定する。計画作成１：GPS, 階層的プランニング講義で指定する。計画作成２：半順序プランニング，即応プランニング講義で指定する。機械学習１：線形識別器講義で指定する。機械学習２：ニューラルネットワーク講義で指定する。機械学習３：決定木，その他講義で指定する。",
    "CSC.T253": "手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展C言語による手続き型プログラミングの発展的な内容について，講義と実習を通して理論と実践の両面から学びます。前半は，ポインタ変数，文字列操作，構造体，メモリ動的割当てについて学びます。後半は，前半の内容を踏まえてアルゴリズムとデータ構造について学ぶと同時に，大規模なプログラムの作成に必要な各種技法についても学びます。さらに，パズルゲームやパターン認識といった実践的な情報処理を対象として，数回にわたって大規模なプログラムを作成します。なお，C言語の基礎事項は「手続き型プログラミング基礎(CSC.T243)」等で履修していることが望まれます。ポインタ変数，構造体，メモリ動的割当てを用いたC言語のプログラムを作成することができます。与えられた問題の解決に最適なアルゴリズムやデータ構造（スタック，キュー，リスト，木構造）を利用することができます。実践的な情報処理に必要とされるプログラミングや大規模プログラムのデバッグに関する技法を使うことができます。手続き型プログラミング手続き型プログラミング手続き型プログラミング手続き型プログラミング手続き型プログラミングポインタ変数ポインタ変数ポインタ変数ポインタ変数ポインタ変数文字列操作文字列操作文字列操作文字列操作文字列操作構造体構造体構造体構造体構造体メモリ動的確保メモリ動的確保メモリ動的確保メモリ動的確保メモリ動的確保スタックスタックスタックスタックスタックキューキューキューキューキューリストリストリストリストリスト木構造木構造木構造木構造木構造木探索木探索木探索木探索木探索アルゴリズムアルゴリズムアルゴリズムアルゴリズムアルゴリズムデータ構造データ構造データ構造データ構造データ構造計算量計算量計算量計算量計算量デバッグデバッグデバッグデバッグデバッグ手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎オブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング基盤人工知能演習基盤人工知能演習基盤人工知能演習基盤人工知能演習基盤人工知能演習基盤データサイエンス演習基盤データサイエンス演習基盤データサイエンス演習基盤データサイエンス演習基盤データサイエンス演習情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第一情報リテラシ第二情報リテラシ第二情報リテラシ第二情報リテラシ第二情報リテラシ第二プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習【実習】発展的プログラミングへの導入，実習環境の準備授業時間内に与えられます。【講義】ポインタ変数授業時間内に与えられます。【実習】ポインタ変数に関する実習授業時間内に与えられます。【講義】文字列操作授業時間内に与えられます。【実習】文字列操作に関する実習授業時間内に与えられます。【講義】構造体，メモリ動的割当て授業時間内に与えられます。【実習】構造体，メモリ動的割当てに関する実習授業時間内に与えられます。【講義】スタック，キュー，リスト授業時間内に与えられます。【実習】スタック，キュー，リストに関する実習授業時間内に与えられます。【講義】木構造、木探索授業時間内に与えられます。【実習】情報処理課題（発展）に関するプログラム設計授業時間内に与えられます。【講義】大規模プログラム作法、発展的話題授業時間内に与えられます。【実習】情報処理課題（発展）に関するプログラム実装・評価授業時間内に与えられます。理解度確認授業時間内に与えられます。",
    "CSC.T261": "情報論理情報論理情報論理情報論理情報論理情報論理情報論理",
    "CSC.T244": "プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習プログラミング創造演習本演習の対象者は，プログラミング言語CあるいはC++による手続き型プログラミングの基礎的および発展的な内容についてある程度習熟した者とする．本演習の目的は，自ら設定した課題を通して，履修者がプログラミングに関する高度な知識および技術を身に着けることである．演習の開始時に，受講者は担当教員と相談してプログラミングに関する課題を設定する．履修者は各演習回において，設定した課題の達成に向けた取組を行う．課題の例（この例に限らない）：* 新しいソフトウェアの設計と実装* これまでに作成したソフトウェアのさらなる発展* プログラミングコンテストあるいはセキュリティコンテストに向けた実習本演習では，プログラミングに関する創造的な課題を設定する力に加え，課題の達成に必要な知識と技術の取得を通して，履修者はプログラミングに関する高度な知識および技術を身に着ける．プログラミングプログラミングプログラミングプログラミングプログラミングソフトウェア開発ソフトウェア開発ソフトウェア開発ソフトウェア開発ソフトウェア開発プログラミングコンテストプログラミングコンテストプログラミングコンテストプログラミングコンテストプログラミングコンテストサイバーセキュリティコンテストサイバーセキュリティコンテストサイバーセキュリティコンテストサイバーセキュリティコンテストサイバーセキュリティコンテスト手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展演習の進め方についての説明課題設定方法および演習の進め方について理解する課題設定課題を設定する課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う中間報告会準備課題の達成状況等，報告すべき実行を整理する中間報告会課題の達成状況等について報告を行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う課題への取組み課題の達成に向けた取組みを行う最終報告会準備課題の達成状況等，報告すべき実行を整理する最終報告会最終的な課題の達成状況等について報告を行う",
    "CSC.T374": "システム制御システム制御システム制御システム制御システム制御システム制御システム制御サイバーフィジカルシステム(CPS)においては，情報通信技術を用いて物理的な機器を自動制御することは基本的なタスクの１つである．本講義では，フィードバック制御の理論について，その基礎を学ぶ．ラプラス変換を基礎として，フィードバック制御系の解析方法と安定性の判別法，サーボ系の設計理論などフィードバック制御の基礎について述べる．フィードバック制御系の解析の基礎を理解し，周波数応答に基づく設計手法を習得することが目標である．また，後半では制御システムの実装を見据えてディジタル制御の基礎についても触れる．制御システムの解析と設計のための基礎を学び，以下の事項を理解する．・フィードバック制御の利点・周波数応答・フィードバック制御系の内部安定性・フィードバック制御系の設計：PID補償，位相進み遅れ補償・ディジタル制御の基礎・数値計算ソフトMatlabを用いた制御システムの扱いフィードバック制御フィードバック制御フィードバック制御フィードバック制御フィードバック制御動的システム動的システム動的システム動的システム動的システム伝達関数伝達関数伝達関数伝達関数伝達関数安定性安定性安定性安定性安定性周波数応答周波数応答周波数応答周波数応答周波数応答ボード線図ボード線図ボード線図ボード線図ボード線図制御系設計制御系設計制御系設計制御系設計制御系設計ディジタル制御ディジタル制御ディジタル制御ディジタル制御ディジタル制御数値計算法数値計算法数値計算法数値計算法数値計算法システム解析システム解析システム解析システム解析システム解析動的システム動的システム動的システム動的システム動的システム問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定フィードバック制御とは自動制御の歴史，最先技術の紹介システムモデルと伝達関数システムモデルと伝達関数，安定性の判別，Matlab Control Toolbox の使い方周波数応答 (1)正弦波入力に対する線形システムの応答の特徴づけ，周波数応答，ベクトル軌跡周波数応答 (2)ベクトル軌跡，ボード線図フィードバック系の安定性 (1)ナイキストの安定判別法フィードバック系の安定性 (2)ゲイン余裕や位相余裕などの概念前半の学力確認演習フィードバック制御系の特性 (1)感度関数を用いた閉ループ系の特徴，制御系の型フィードバック制御系の特性 (2)サーボ系を設計するための基本原理である内部モデル原理などフィードバック制御系の設計 (1)PID補償による方法フィードバック制御系の設計 (2)位相進み遅れ補償による方法などディジタル制御 (1): はじめにディジタル機器による制御ディジタル制御 (2): 離散時関系の表現と解析z変換，差分方程式，伝達関数ディジタル制御 (3): サンプリングと離散化，ディジタル再設計連続時間システムの離散化，制御器のディジタル再設計",
    "CSC.T343": "データベースデータベースデータベースデータベースデータベースデータベースデータベース本講義は、今や情報システムの最も重要な基盤の一つとして位置づけられるデータベースシステムにおける概念、モデル、技術に関する包括的な導入を目指している。本講義では、まず関係代数、関係論理、正規形を含む関係モデルについて論じる。次にデーターベースの概念設計、SQL を含む問い合わせ言語、同時実行制御、障害回復を含む重要な概念であるトランザクションについて述べる。さらに、データの格納方法や索引、あるいは問い合わせ処理に関する技術に関しても取り扱う。オブジェクト指向データベース、XMLデータベースやRDFデータベースといった最近のトレンドについても紹介する。本講義を履修することによって以下を習得する。1) データベースに関する基本概念とモデルの理解2) 要求を満たす正規形のデータベースの設計3) データベースに対する適切な問い合わせの記述4) トランザクションの同時実行制御と障害回復の取り扱い5) データ格納方法、索引、問い合わせ処理に関する技法の活用6) データベースにおける最近のトレンドに関する知識関係モデル関係モデル関係モデル関係モデル関係モデル関係代数関係代数関係代数関係代数関係代数関係論理関係論理関係論理関係論理関係論理正規形正規形正規形正規形正規形概念設計概念設計概念設計概念設計概念設計問い合わせ言語問い合わせ言語問い合わせ言語問い合わせ言語問い合わせ言語SQLSQLSQLSQLSQLトランザクショントランザクショントランザクショントランザクショントランザクション同時実行制御同時実行制御同時実行制御同時実行制御同時実行制御障害回復障害回復障害回復障害回復障害回復データ格納方法データ格納方法データ格納方法データ格納方法データ格納方法索引索引索引索引索引問い合わせ処理問い合わせ処理問い合わせ処理問い合わせ処理問い合わせ処理オブジェクト指向データベースオブジェクト指向データベースオブジェクト指向データベースオブジェクト指向データベースオブジェクト指向データベースXMLデータベースXMLデータベースXMLデータベースXMLデータベースXMLデータベースRDFデータベースRDFデータベースRDFデータベースRDFデータベースRDFデータベースプログラミング第一プログラミング第一プログラミング第一プログラミング第一プログラミング第一プログラミング第二プログラミング第二プログラミング第二プログラミング第二プログラミング第二数理論理学数理論理学数理論理学数理論理学数理論理学オペレーティングシステムオペレーティングシステムオペレーティングシステムオペレーティングシステムオペレーティングシステムイントロダクション：データベースの基本概念、データモデル、関係モデルデータベースの概念の理解関係モデル：関係代数関係代数の理解関係モデル：関係論理、正規形関係論理と正規形の理解実体関連モデル、データ定義言語、データ操作言語、関係完備概念モデルとデータ定義・操作言語の理解問い合わせ記述 （SQL, QBE）、集約演算問い合わせ記述更新記述、データ定義、VIEW更新、データ定義の記述中間試験前半項目の理解の確認トランザクション１：ACID性、2相ロック、階層ロックトランザクションの概念の理解トランザクション２：時刻印方式、多版管理、障害回復、RAID障害回復方法の理解データ格納方法：不揮発性記憶媒体、ページ、レコード、索引データ格納方法の理解問い合わせ処理１：射影演算、選択演算、入れ子結合、マージ結合問い合わせ処理の理解問い合わせ処理２：ハッシュ結合、割り算、集合積、集合和問い合わせ処理の理解オブジェクト指向データベース、ORDBオブジェクト指向モデルの理解XMLデータベース、RDFデータベースXML/RDF データベースの理解",
    "CSC.T363": "コンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャ情報工学分野において、コンピュータの動作原理と高性能化のための方式を理解し、さらにハードウェアとソフトウェアの相互関係を習得することは非常に重要です。本講義では、プロセッサ、メモリ、入出力、マルチプロセッサ、マルチコアというコンピュータシステムを構成する各種装置について、その役割と動作原理を学びます。演習では、Verilog HDL等のハードウェア記述言語を用いてFPGAが搭載されたハードウェアボード等に高度なディジタル回路であるプロセッサを実装し、プログラムを動作させることでハードウェアとソフトウェアの相互関係を習得します。本講義を履修することによってコンピュータ以下を習得する。・コンピュータの動作原理と高性能化のためのアーキテクチャ・プロセッサ、メモリ、入出力、マルチプロセッサ、マルチコアといったコンピュータシステムを構成する各種装置の役割と動作原理・ハードウェア記述言語を用いた一般的なコンピュータシステムの設計能力コンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャプロセッサプロセッサプロセッサプロセッサプロセッサスーパースカラスーパースカラスーパースカラスーパースカラスーパースカラキャッシュキャッシュキャッシュキャッシュキャッシュメモリ階層メモリ階層メモリ階層メモリ階層メモリ階層仮想記憶仮想記憶仮想記憶仮想記憶仮想記憶マルチプロセッサマルチプロセッサマルチプロセッサマルチプロセッサマルチプロセッサマルチコアマルチコアマルチコアマルチコアマルチコアハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語Verilog HDLVerilog HDLVerilog HDLVerilog HDLVerilog HDLFPGAFPGAFPGAFPGAFPGA論理回路理論論理回路理論論理回路理論論理回路理論論理回路理論アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャコンピュータの構成と動作原理コンピュータの構成と動作原理について理解する。コンピュータの性能と消費電力の動向コンピュータの性能と消費電力の動向について理解する。コンピュータ設計演習(1)コンピュータ設計演習(1)半導体メモリ半導体メモリについて理解する。コンピュータ設計演習(2)コンピュータ設計演習(2)キャッシュ：ダイレクトマップ方式ダイレクトマップ方式のキャッシュについて理解する。キャッシュ：セットアソシアティブ方式セットアソシアティブ方式のキャッシュについて理解する。コンピュータ設計演習(3)コンピュータ設計演習(3)メモリシステムの階層化と信頼性メモリシステムの階層化と信頼性について理解する。パイプラインプロセッサパイプラインプロセッサについて理解する。コンピュータ設計演習(4)コンピュータ設計演習(4)スーパースカラプロセッサスーパースカラプロセッサについて理解する。分岐予測分岐予測について理解する。コンピュータ設計演習(5)コンピュータ設計演習(5)ベクタ、SIMDにおけるデータレベル並列性ベクタ、SIMDにおけるデータレベル並列性について理解する。仮想記憶、セキュリティ仮想記憶、セキュリティについて理解する。コンピュータ設計演習(6)コンピュータ設計演習(6)入出力、バス入出力、バスについて理解する。相互接続ネットワーク相互接続ネットワークについて理解する。コンピュータ設計演習(7)コンピュータ設計演習(7)マルチプロセッサ、マルチコアマルチプロセッサ、マルチコアについて理解する。",
    "CSC.T345": "コンピュータネットワークコンピュータネットワークコンピュータネットワークコンピュータネットワークコンピュータネットワークコンピュータネットワークコンピュータネットワーク今やスマートフォンから5GやWIFIを通して他国のクラウドサーバにアクセスするのは日常生活の一部になっているが，その背景には無数の革新的な要素技術が絶妙なバランスで統合されている．本講義ではそれぞれの要素技術の歴史的背景や基本原理，長所と短所，堅牢性や拡張性の背景にある考え方を学習することで普段なにげなく使っている計算機ネットワークに対する本質的な理解を深め，より発展的なネットワークの業務や研究を遂行するための素地を提供する．計算機ネットワークを参照モデルの視点から階層的に説明できるようになる．有線伝送や無線伝送におけるデジタル変調と多重化の原理を説明できるようになる．データの誤りを検出・訂正できるようになる．各々のプロトコルの短所や限界を理解し，適切に選択できるようになる．パケット交換方式，ルーティング，TCP/IPの基本概念を理解し，これらの要素技術の意義を説明できるようになる．暗号化技術の原理を理解し，その脆弱性を判断できるようになる．デジタル変調デジタル変調デジタル変調デジタル変調デジタル変調多重化多重化多重化多重化多重化誤り検出誤り検出誤り検出誤り検出誤り検出誤り訂正誤り訂正誤り訂正誤り訂正誤り訂正チャネル割り当て問題チャネル割り当て問題チャネル割り当て問題チャネル割り当て問題チャネル割り当て問題イーサネットイーサネットイーサネットイーサネットイーサネット無線LAN無線LAN無線LAN無線LAN無線LANスイッチングスイッチングスイッチングスイッチングスイッチングルーティングルーティングルーティングルーティングルーティング輻輳制御輻輳制御輻輳制御輻輳制御輻輳制御UDPUDPUDPUDPUDPTCPTCPTCPTCPTCPDNSDNSDNSDNSDNS電子メール電子メール電子メール電子メール電子メールウェブウェブウェブウェブウェブネットワークセキュリティネットワークセキュリティネットワークセキュリティネットワークセキュリティネットワークセキュリティ対称鍵暗号対称鍵暗号対称鍵暗号対称鍵暗号対称鍵暗号公開鍵暗号公開鍵暗号公開鍵暗号公開鍵暗号公開鍵暗号デジタル署名デジタル署名デジタル署名デジタル署名デジタル署名認証プロトコル認証プロトコル認証プロトコル認証プロトコル認証プロトコル数理計画法数理計画法数理計画法数理計画法数理計画法オペレーティングシステムオペレーティングシステムオペレーティングシステムオペレーティングシステムオペレーティングシステム無線通信システム無線通信システム無線通信システム無線通信システム無線通信システムネットワーク基礎知識1\r\nプロトコルの階層化プロトコルの階層化と OSI 参照モデルの 各層の役割を説明できるネットワーク基礎知識2\r\nネットワークの構成要素通信方針の分類ができ、リピータ、ブリッジ、 ルータの違いが説明できるTCP/IP 基礎知識\r\nTCP/IP プロトコルの階層モデルTCP/IP とインターネットの関係を理解し、 プロトコルの階層モデルと通信例が挙げられるデータリンク1\r\nイーサネットと無線通信イーサネットのフレームフォーマットを理解でき、\r\n無線通信の規格と特性を評価できるデータリンク2\r\nPPP、公衆アクセス網PPP のフレームフォーマットを理解でき、 公衆アクセス網の規格と特性を評価できるIP プロトコル1\r\nIP アドレスとルーディング, 分割処理IP アドレスの役割を理解しルーティングの挙動を予測でき，IP データグラムの分割処理ができる中間試験\r\n第1回から第6回までの理解度確認と到達度自己評価IP に関連する技術\r\nDNS, ARP, ICMP, DHCP, NATDNS, ARP, ICMP, DHCP, NATの仕組みと役割を説明できるTCPとUDP1\r\nトランスポート層の役割とポート番号トランスポート層の役割を理解し、IP アドレスとポート番号による識別ができるTCPとUDP2\r\nTCP と UDP プロトコルTCP と UDP の違いを理解し、 再送制御、輻輳制御の原理を説明できるルーティングプロトコル\r\nRIP, OSPF, BGP, MPLSルーティングプロトコルを複数挙げられ、それらの特性を理解し場面に応じて選択できるアプリケーションプロトコル\r\nSSH, FTP, SMTP, IMAP, HTML代表的なアプリケーションプロトコルを挙げられ、\r\nそれぞれの仕組み理解して使うことができるセキュリティ\r\nファイアウォール、暗号化技術暗号技術の基礎を理解し、ネットワークを安全に使うことができる期末試験第1回から第13回までの理解度確認と 到達度自己評価",
    "CSC.T375": "システム構築演習システム構築演習システム構築演習システム構築演習システム構築演習システム構築演習システム構築演習",
    "CSC.T342": "問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定",
    "CSC.T362": "数値計算法数値計算法数値計算法数値計算法数値計算法数値計算法数値計算法実世界を微分方程式等を用いてモデル化し，計算機を用いて数値的に解析・シミュレートするための基礎となる数値計算の方法の基礎を理解するとともに，代表的な問題に対するアルゴリズムを学習し，応用できる基礎力を養成する．・実世界をモデリングし計算機を用いて数値的に取り扱うことについて理解する・微分方程式の解析的な解法と数値的な解法について理解する・数値計算における重要な問題（誤差，桁落ち等）について理解する・連立一次方程式の数値解法を修得する・非線形方程式の数値解法を修得する・数値微分・数値積分を理解し，常微分/偏微分方程式の数値解法を修得する・データの補間と最小二乗法の手法を修得する連立1次方程式連立1次方程式連立1次方程式連立1次方程式連立1次方程式常微分方程式常微分方程式常微分方程式常微分方程式常微分方程式偏微分方程式偏微分方程式偏微分方程式偏微分方程式偏微分方程式数値積分数値積分数値積分数値積分数値積分非線形方程式非線形方程式非線形方程式非線形方程式非線形方程式補間補間補間補間補間最小二乗法最小二乗法最小二乗法最小二乗法最小二乗法モンテ・カルロ法モンテ・カルロ法モンテ・カルロ法モンテ・カルロ法モンテ・カルロ法誤差誤差誤差誤差誤差動的システム動的システム動的システム動的システム動的システムシステムモデリングシステムモデリングシステムモデリングシステムモデリングシステムモデリングシステム解析システム解析システム解析システム解析システム解析動的システム動的システム動的システム動的システム動的システムシステム制御システム制御システム制御システム制御システム制御問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析非線形システム非線形システム非線形システム非線形システム非線形システム連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング離散系のモデリング離散系のモデリング離散系のモデリング離散系のモデリング離散系のモデリング情報系グループ型問題解決演習（情報生命）情報系グループ型問題解決演習（情報生命）情報系グループ型問題解決演習（情報生命）情報系グループ型問題解決演習（情報生命）情報系グループ型問題解決演習（情報生命）数値計算法の基礎 (1)実世界のモデリングと数値解析，単位と次元，実数の表現（浮動小数点），誤差の種類数値計算法の基礎 (2)誤差の分析，桁落ち，計算量，刻み幅，数値解析ライブラリと数値解析アプリケーション数値微分と数値積分差分，台形則，Simpson則非線形方程式の数値解法2分法，Newton法常微分方程式の解析的な解法，常微分方程式の数値解法 (1)常微分方程式の解析的な解法（数値計算法ではない解法），常微分方程式の初期値問題，陽的解法，Euler法，Runge-Kutta法常微分方程式の数値解法 (2)硬い方程式，陰的解法，常微分方程式の境界値問題常微分方程式の数値解法 (3)2階常微分方程式，動的システムのモデリング，動的システムの例（減衰振動，van der Pol方程式，他）連立1次方程式の数値解法 (1)直接法：Gaussの消去法，LU分解連立1次方程式の数値解法 (2)反復法：Jacobi反復法，Gauss-Seidel法，逐次過緩和(SOR)法曲線の推定法 (1)補間と関数近似，Lagrange補間，Spline補間曲線の推定法 (2)最小二乗法，データフィッティング偏微分方程式の解析解と数値解法 (1)偏微分方程式の基礎，偏微分方程式の解析解法（数値計算法ではない解法）偏微分方程式の解析解と数値解法 (2)有限差分法，Gauss-Seidel法，逐次過緩和(SOR)法モンテ・カルロ法の基礎と実験データの統計的な解析確率過程を利用した数値計算法，実験データの統計的な解析",
    "CSC.T373": "動的システム動的システム動的システム動的システム動的システム動的システム動的システムIoT時代においてサイバーフィジカルシステム(CPS)に注目が集まりつつある。このような背景の中で、情報工学を学ぶ者は計算機(サイバー)だけでなく実世界(フィジカル)のモデル化についても理解を深める必要がある。そこで本授業では実世界を動的システムとして表現し解析するための基礎を習得する。具体的には、状態方程式や伝達関数のシステム表現、および、それに対応する解析手法に関する基礎知識を学習する。本講義を履修することにより，以下の知識と能力を修得する。1) 動的システムの全体像を理解する。2) 動的システムのシステム表現とシステム解析の基礎を習得する。3) 状態空間と伝達関数を用いるモデリングの方法論を身につける。4) 状態空間と伝達関数におけるシステム解析の方法論を身につける。5) 数値解析によって動的システムの振舞いを可視化できる。動的システム動的システム動的システム動的システム動的システムシステム表現システム表現システム表現システム表現システム表現システム解析システム解析システム解析システム解析システム解析状態空間状態空間状態空間状態空間状態空間状態方程式状態方程式状態方程式状態方程式状態方程式モデリングモデリングモデリングモデリングモデリング同型性同型性同型性同型性同型性１次系１次系１次系１次系１次系２次系２次系２次系２次系２次系安定性安定性安定性安定性安定性伝達関数伝達関数伝達関数伝達関数伝達関数ブロック線図ブロック線図ブロック線図ブロック線図ブロック線図過渡応答過渡応答過渡応答過渡応答過渡応答周波数応答周波数応答周波数応答周波数応答周波数応答数値解析数値解析数値解析数値解析数値解析非線形システム非線形システム非線形システム非線形システム非線形システムサイバーフィジカルシステムサイバーフィジカルシステムサイバーフィジカルシステムサイバーフィジカルシステムサイバーフィジカルシステム数値計算法数値計算法数値計算法数値計算法数値計算法システム解析システム解析システム解析システム解析システム解析システム制御システム制御システム制御システム制御システム制御問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定非線形システム非線形システム非線形システム非線形システム非線形システム連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリング連続系のモデリングはじめになぜ動的システムを学ぶのか？\r\n状態空間表現１状態方程式、線形代数の基礎状態空間表現２状態方程式の解、状態空間と軌道状態空間表現３安定性、可制御性と可観測性状態空間表現４状態フィードバック、オブザーバ小テスト伝達関数表現１伝達関数、ラプラス変換の基礎伝達関数表現２システムの応答特性、安定性と極伝達関数表現３周波数応答伝達関数表現４フィードバック系の安定性小テスト数値解析 １フィードバック制御系数値解析 2非線形システムへの展開おわりに情報工学と動的システム",
    "CSC.T344": "システムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングUNIXをはじめとするオペレーティングシステムが提供するシステムコールおよびそれを利用したプログラミング法を理解する．特に，プロセスとプロセス間通信の概念，ファイル抽象，ソケット通信の基礎を学習し，実際のプログラミング言語によるプログラミングを実践する．システムコールを利用したプログラムを記述できること．特に，プロセスとプロセス間通信の概念，ファイル抽象，ソケット通信の概念を理解し，それらを利用したプログラムを記述できること．システムコールシステムコールシステムコールシステムコールシステムコールプロセスプロセスプロセスプロセスプロセスソケット通信ソケット通信ソケット通信ソケット通信ソケット通信シグナルシグナルシグナルシグナルシグナルプログラミング支援ツールプログラミング支援ツールプログラミング支援ツールプログラミング支援ツールプログラミング支援ツールCCCCC手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミングシステムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアイントロダクションイントロダクション演習: UNIX環境演習: UNIX環境入出力，ファイル抽象入出力，ファイル抽象演習: 入出力，ファイル抽象演習: 入出力，ファイル抽象プロセス，フォークプロセス，フォークパイプパイプ演習: プロセス 基礎演習: プロセス 基礎演習: プロセス 発展 演習: プロセス 発展シグナル，ソケット通信シグナル，ソケット通信演習: シグナル，ソケット通信演習: シグナル，ソケット通信メモリ管理メモリ管理演習: メモリ管理演習: メモリ管理システムプログラミングツールシステムプログラミングツール演習: システムプログラミングツール演習: システムプログラミングツール",
    "CSC.T364": "システム設計演習システム設計演習システム設計演習システム設計演習システム設計演習システム設計演習システム設計演習",
    "CSC.T352": "パターン認識パターン認識パターン認識パターン認識パターン認識パターン認識パターン認識本講義は生成モデルに基づくパターン認識の数理的な基礎を提供する．生成モデルによるパターン認識の概念を説明できる．モデルの記述に必要となる数理を理解できる．講義で説明するパターン認識のモデルを計算機で実装できるようになる．パターン認識パターン認識パターン認識パターン認識パターン認識 統計的機械学習 統計的機械学習 統計的機械学習 統計的機械学習 統計的機械学習生成モデル生成モデル生成モデル生成モデル生成モデル最尤推定最尤推定最尤推定最尤推定最尤推定ベイズ推定ベイズ推定ベイズ推定ベイズ推定ベイズ推定関数解析学関数解析学関数解析学関数解析学関数解析学確率論・統計学確率論・統計学確率論・統計学確率論・統計学確率論・統計学人工知能人工知能人工知能人工知能人工知能生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析パターン認識とは第１章を講義前に精読統計的パターン認識の基礎第１章を講義前に精読識別関数のよさを測る規準第３章を講義前に精読最尤推定法第４章を講義前に精読線形判別分析による⼿書き⽂字認識１第６章を講義前に精読最尤推定におけるモデル選択第7章 を講義前に精読最尤推定の理論的性質第５章を講義前に精読混合モデルとその最尤推定第8章 を講義前に精読線形判別分析による⼿書き⽂字認識２第2章を講義前に精読ベイズ推定第9章を講義前に精読ベイズ推定の数値計算法第10章を講義前に精読ベイズ推定のモデル選択と近似的な推論法第11章を講義前に精読カーネル密度推定第12章を講義前に精読最近傍密度推定法第13章を講義前に精読",
    "CSC.T341": "コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計コンピュータ論理設計本講義では、「論理回路理論」の講義で習得した知識をベースに、より実用的なディジタル回路について学ぶ。また、簡単なコンピュータを例題として、コンピュータの基本原理とその論理設計の方法を学習する。演習では、学んだ組合せ回路と順序回路をVerilog HDL等のハードウェア記述言語で記述し、シミュレーションによる回路の動作検証、FPGAが搭載されたハードウェアボード等に実装して動作確認をおこなう。本講義を履修することによって以下を習得する。・コンピュータシステムの基本構成・シングルサイクルプロセッサの論理設計に関する知識・パイプライン処理をおこなうプロセッサの論理設計に関する知識・ハードウェア記述言語を用いたシンプルなコンピュータシステムの設計能力コンピュータコンピュータコンピュータコンピュータコンピュータ命令セットアーキテクチャ命令セットアーキテクチャ命令セットアーキテクチャ命令セットアーキテクチャ命令セットアーキテクチャプロセッサプロセッサプロセッサプロセッサプロセッサパイプライン処理パイプライン処理パイプライン処理パイプライン処理パイプライン処理ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語ハードウェア記述言語Verilog HDLVerilog HDLVerilog HDLVerilog HDLVerilog HDLFPGAFPGAFPGAFPGAFPGA論理回路理論論理回路理論論理回路理論論理回路理論論理回路理論アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャ先端コンピュータアーキテクチャコンピュータシステムの基本構成コンピュータシステムの基本構成について理解する。論理設計演習(1)論理設計演習(1)ハードウェア記述言語：組合せ回路組合せ回路の記述を理解する。ハードウェア記述言語：順序回路 順序回路の記述を理解する。論理設計演習(2)論理設計演習(2)ハードウェア記述言語：よく使われる回路よく使われる回路の記述を理解する。リコンフィギャラブルシステムリコンフィギャラブルシステムとFPGAボードについて理解する。論理設計演習(3)論理設計演習(3)命令セットアーキテクチャ：データ表現とアドレス指定形式 ISAにおけるデータ表現とアドレス指定形式について理解する。命令セットアーキテクチャ：算術論理演算命令ISAにおける算術論理演算命令について理解する。論理設計演習(4)論理設計演習(4)命令セットアーキテクチャ：ロードストア命令と分岐命令ISAにおけるロードストア命令と分岐命令について理解する。プロセッサの基本構成要素：算術論理演算ユニット算術論理演算ユニットについて理解する。論理設計演習(5)論理設計演習(5)プロセッサの基本構成要素：レジスタファイルとメモリレジスタファイルとメモリについて理解する。シングルサイクルプロセッサのデータパスシングルサイクルプロセッサのデータパスについて理解する。論理設計演習(6)論理設計演習(6)シングルサイクルプロセッサの制御シングルサイクルプロセッサの制御について理解する。パイプライン処理パイプライン処理について理解する。論理設計演習(7)論理設計演習(7)パイプラインハザードとデータフォワーディングパイプラインハザードとデータフォワーディングについて理解する。",
    "CSC.T372": "コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンパイラ構成コンピュータの基本的な動作原理を理解するために，プログラミング言語処理系のうち，特にコンパイラの理論とテクニックを学習する．【到達目標】コンパイラの理論とテクニックの習得を到達目標とする．【テーマ】字句解析，構文解析，文脈自由文法，再帰下降構文解析，LL構文解析，LR構文解析，意味解析，コード生成，最適化字句解析字句解析字句解析字句解析字句解析構文解析構文解析構文解析構文解析構文解析文脈自由文法文脈自由文法文脈自由文法文脈自由文法文脈自由文法再帰下降構文解析再帰下降構文解析再帰下降構文解析再帰下降構文解析再帰下降構文解析LL構文解析LL構文解析LL構文解析LL構文解析LL構文解析LR構文解析LR構文解析LR構文解析LR構文解析LR構文解析意味解析意味解析意味解析意味解析意味解析コード生成コード生成コード生成コード生成コード生成最適化最適化最適化最適化最適化アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展イントロダクションイントロダクション字句解析，正規表現 (1)字句解析，正規表現 (1)字句解析，正規表現 (2)字句解析，正規表現 (2)構文解析，文脈自由文法 (1)：BNF，抽象構文木(AST)構文解析，文脈自由文法 (1)：BNF，抽象構文木(AST)構文解析，文脈自由文法 (2)：再帰下降構文解析，LL構文解析構文解析，文脈自由文法 (2)：再帰下降構文解析，LL構文解析中間テスト中間テスト構文解析，文脈自由文法 (3)：LR構文解析構文解析，文脈自由文法 (3)：LR構文解析構文解析，文脈自由文法 (4)：PEG (parsing expression grammar)構文解析，文脈自由文法 (4)：PEG (parsing expression grammar)意味解析 (1)：記号表，スコープ意味解析 (1)：記号表，スコープ意味解析 (2)：型検査意味解析 (2)：型検査コード生成 (1)：制御構文コード生成 (1)：制御構文コード生成 (2)：定数，変数，式コード生成 (2)：定数，変数，式コード生成 (3)：関数呼び出し，スタックフレームコード生成 (3)：関数呼び出し，スタックフレームコード最適化 コード最適化 ",
    "CSC.T351": "システム解析システム解析システム解析システム解析システム解析システム解析システム解析動的システムを解析するために必要な数学的基礎を講義する．まず，数学的準備として複素関数論の基礎を述べる．そして，フーリエ級数展開，フーリエ変換とラプラス変換を解説する．本系の「システム系科目」で必須となるシステム解析の数学的基礎を習得することが本講義の目標である．具体的には，フーリエ級数展開，フーリエ変換とラプラス変換を習得することにより，動的システムを解析するための基礎を身につける．複素関数論複素関数論複素関数論複素関数論複素関数論　周波数領域　周波数領域　周波数領域　周波数領域　周波数領域　フーリエ級数展開　フーリエ級数展開　フーリエ級数展開　フーリエ級数展開　フーリエ級数展開　フーリエ変換　フーリエ変換　フーリエ変換　フーリエ変換　フーリエ変換　ラプラス変換　ラプラス変換　ラプラス変換　ラプラス変換　ラプラス変換動的システム動的システム動的システム動的システム動的システムシステム制御システム制御システム制御システム制御システム制御数値計算法数値計算法数値計算法数値計算法数値計算法問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定問題解決と意思決定講義概要， 複素関数論（1）複素数と複素関数の性質1複素関数論（2）複素数と複素関数の性質2 複素関数論（3）複素関数の微分複素関数論（4）複素関数の積分1 複素関数論（5）複素関数の積分2複素関数論（6）複素関数の展開 フーリエ級数展開（1）導入フーリエ級数展開（2）例と性質フーリエ変換（1）導入フーリエ変換（2）例と性質1フーリエ変換（3）例と性質2ラプラス変換（1）導入ラプラス変換（2）例と性質1ラプラス変換（3）例と性質2",
    "CSC.T361": "オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計【ねらい】オブジェクト指向の要求分析・設計技術および実践力を習得することを目的とする．【概要】オブジェクト指向設計法やデザインパターンを用いて，ソフトウェア設計・構築のやり方を実習を通して習得する。また，実例により有用性を学習する。ユースケース法などによる要求分析から，クラス図作成，実装，テストといった一連のソフトウェア開発が行える技能を身につける。オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計オブジェクト指向設計クラス図クラス図クラス図クラス図クラス図ユースケース法ユースケース法ユースケース法ユースケース法ユースケース法デザインパターンデザインパターンデザインパターンデザインパターンデザインパターンテストテストテストテストテストメトリックスメトリックスメトリックスメトリックスメトリックスリファクタリングリファクタリングリファクタリングリファクタリングリファクタリングUMLUMLUMLUMLUMLJavaJavaJavaJavaJavaオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングソフトウェア開発プロセス概説とJava復習Javaでのプログラミング拡張性の高い設計スーパークラスを使った設計と独立性の理解クラス図クラス図を書くツールを使ったクラス図作成（実習）Eclipseを使ったクラス図の作成単体テストEclipseを使ったJUnitの活用法の理解オブジェクト指向設計の特徴データ抽象，ポリモルフィズム，抽象クラスの理解，デザインパターンの基本的な考え方の理解デザインパターン(1)構造と振る舞いのデザインパターンを使いこなすデザインパターン(2)生成のデザインパターンを使いこなす設計の改善：ソフトウェアメトリックスメトリックスの理解と実践設計の改善：リファクタリングリファクタリングの理解と実践要求分析序論とユースケース法要求分析の重要性の理解，ユースケース図，ユースケース記述を書ける要求仕様からのクラス図導出ユースケース法とCRC法を理解するCRC法によるクラス図の導出（実習）CRC法を使いこなせるUML序論UMLの理解とシーケンス図が書けるなしなし",
    "CSC.T354": "並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミング並列プログラミングは近年の計算機で効果的に高速に演算させるためには必須の技術である。本講義及び演習では並列プログラミングのための基礎知識と具体的な実装法を習得する。並列プログラムでは、非並列プログラムでは生じない不具合が起きる。不具合がなぜ起きるのかの理由や不具合を発生させないための手法を講義では学び、具体的なプログラミングを演習では体験する。そのためプログラミングの知識は事前に身につけた上で受講されたい。使用言語は主にJavaである。並列プログラムを正しく組み立てるための、正しいデータ資源の共有、同期化、計算資源適切な分配、遅延実行と開始などの知識と技術を身につけることを目標とする。代表的な題目としては1)データの実体の格納されている領域の理解2)スレッドプログラミング3)イベントドリブンプログラミング4)GPUプログラミングスレッドプログラミングスレッドプログラミングスレッドプログラミングスレッドプログラミングスレッドプログラミングGPUプログラミングGPUプログラミングGPUプログラミングGPUプログラミングGPUプログラミングGUIプログラミングGUIプログラミングGUIプログラミングGUIプログラミングGUIプログラミング可視性可視性可視性可視性可視性同期同期同期同期同期モニタモニタモニタモニタモニタアトミシティアトミシティアトミシティアトミシティアトミシティ関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎関数型プログラミング基礎オブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングオブジェクト指向プログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャ導入、イベント駆動\r\nイベントとイベントハンドラ演習１\r\nJavaFX プログラムイベント駆動(2)\r\nスレッドイベント転送\r\nスレッド, モニタ演習２JavaFX プログラム２スレッド安全\r\n復習:データとその格納法非共有、不可変、同期\r\n浅いコピーと深いコピー、実体と参照演習３実体と参照の復習、多型性の利用\r\n競合状態スレッドと複雑な同期\r\nアトミックウェイト、ジョイン、ノーティファイ\r\n飢餓演習４並行サーバ遅延実行\r\nストリームストリーム、ラムダ式、スレッドプール演習５ラムダ式とストリームGPU プログラミングOpenCL演習６OpenCLGPUプログラミング　画像処理データ並列計算演習７画像処理\r\n総合応用プログラム",
    "CSC.T377": "情報工学英語プレゼンテーション情報工学英語プレゼンテーション情報工学英語プレゼンテーション情報工学英語プレゼンテーション情報工学英語プレゼンテーション情報工学英語プレゼンテーション情報工学英語プレゼンテーション講義の目的は，学会発表などの実践例を通して，英語によるプレゼンテーションの基礎を修得することです．(1) 効果的なスライドやポスターが作れる(2) 英語で口頭発表/ポスター発表ができる報告書作成報告書作成報告書作成報告書作成報告書作成口頭発表口頭発表口頭発表口頭発表口頭発表ポスター発表ポスター発表ポスター発表ポスター発表ポスター発表特に無し特に無し特に無し特に無し特に無し英語スピーキングの技術英語スピーキングの技術英語スピーキングの実習英語スピーキングの実習口頭発表の技術口頭発表の技術口頭発表の実習口頭発表の実習ポスター発表の技術ポスター発表の技術ポスター発表の実習ポスター発表の実習",
    "CSC.T371": "システムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアシステムソフトウェアオペレーティングシステムの役割，オペレーティングシステムカーネルの構成と実現方式，およびオペレーティングシステムカーネルにおいて用いられるアルゴリズムを理解する．オペレーティングシステムの中心概念であるカーネルの役割とそこで用いられるアルゴリズムを学ぶ．具体的には，割り込みによるカーネルの実現手法，プロセス管理，同期と排他制御，メモリ管理，ファイルシステム，I/Oシステムなどについて学ぶ，また，Unixを簡素化した教育用オペレーティングシステムxv6（RISC-V版）を教材として，これらの諸機構がどのように実現されるかについて理解する．OSカーネルOSカーネルOSカーネルOSカーネルOSカーネルシステムコールシステムコールシステムコールシステムコールシステムコールプロセスプロセスプロセスプロセスプロセススケジューリングスケジューリングスケジューリングスケジューリングスケジューリング同期同期同期同期同期相互排除アルゴリズム相互排除アルゴリズム相互排除アルゴリズム相互排除アルゴリズム相互排除アルゴリズムメモリ管理メモリ管理メモリ管理メモリ管理メモリ管理仮想記憶仮想記憶仮想記憶仮想記憶仮想記憶ファイルシステムファイルシステムファイルシステムファイルシステムファイルシステム保護機構保護機構保護機構保護機構保護機構セキュリティ機構セキュリティ機構セキュリティ機構セキュリティ機構セキュリティ機構手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング基礎手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展手続き型プログラミング発展システムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングシステムプログラミングアセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語アセンブリ言語コンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャコンピュータアーキテクチャオペレーティングシステムの役割と機能オペレーティングシステムの役割と機能Unixオペレーティングシステムとxv6の概要Unixオペレーティングシステムおよびxv6の概要について理解する割り込みとシステムコール割り込みとシステムコールについて理解するプロセスとスレッド(1): 基本概念，マルチプロセスプロセスとスレッドの基本概念およびマルチプロセス方式について理解するプロセスとスレッド(2): プロセスのスケジューリングプロセスのスケジューリングアルゴリズムおよびそれらの実現方式について理解するプロセスとスレッド(3): 同期と排他制御アルゴリズム同期に関する諸概念と排他制御アルゴリズムについて理解するプロセスとスレッド(4): 同期と排他制御機構の実現方式同期と排他制御機構の実現方式を理解するメモリ管理(1)：メモリ管理の目的と基本概念メモリ管理の目的と基本概念を理解するメモリ管理(2): 仮想記憶システムの概要とアルゴリズム仮想記憶システムの概要と関連するアルゴリズムを理解するメモリ管理(3): 仮想記憶システムの実現方式仮想記憶システムの実現方式について理解するファイルシステム(1): ファイルシステムの目的と基本概念ファイルシステムの目的と基本概念について理解するファイルシステム(2): ファイル管理アルゴリズムファイル管理アルゴリズムについて理解するファイルシステム(3): ファイルシステムの実現方式ファイルシステムの実現方式について理解するI/Oシステムとその実現方式I/Oシステムとその実現方式について理解する",
    "CSC.T353": "生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析生命情報解析本講義では，爆発的に増加しつつある遺伝子配列やタンパク質構造などの生命情報について，コンピュータ上でデータとして表現・交換するための様々な手法と，そのデータを用いた比較解析，知識抽出などのアルゴリズムの基礎的な例を取り扱う。動的計画法に基づく２本の配列間の最適アラインメントの問題からスタートし，データベースに対する大量検索の場合に用いる高速化手法などを説明する。また多くの配列間の関係を同時に考慮する多重アラインメントや系統樹推定では，厳密解法では本数の増加に対して指数関数的な計算量が必要となることから各種の近似解法が重要であることを説明する。後半では、生物の細胞システム内のさまざまな挙動をシステム的に捉える見方を紹介し、アナログおよびデジタルシミュレーションの基本的な諸手法を紹介する。本講義では，生物学や生化学の事前知識は一切仮定せず，これらについて最小限の入門的な知識を与えた上で，アルゴリズムや計算量といった情報工学的な観点から考察する。　生命科学の急速な発展にともない，生物学・医学・薬学等の分野では，多種類で不均質なデータが大量に得られつつある。生命情報のコンピュータ解析は21世紀の人々の暮らしの向上にきわめて重要であり，情報工学者としても基盤的な理解は身に付けて欲しい。ここで学ぶ手法は，生命情報のみならず実世界の多様なデータの解析と知識抽出に対して適用可能であるため，情報工学で学ぶ手法が実世界にどう応用されるのか，例示を通じて理解を進める効果を狙っている。　本講義を履修することによって次の能力を修得する。１）配列データを表現する各種のモデル（正規表現，プロファイル行列，隠れマルコフモデル）を説明できる２）動的計画法のアルゴリズムを説明でき，それが用いられる複数の実応用を説明できる３）多重アラインメントや進化系統樹推定では近似解法が重要であることを計算量の観点から説明できる４）配列データベースに対する相同性検索におけるE値とP値の意味を説明でき，値を求めることができる５）大規模なデータベースに対する相同性検索の高速化手法について説明できる６）細胞内での各反応をシステム的に捉えるため、微分方程式等を使ったアナログシミュレーション、およびデジタルシミュレーションの基本的手法について説明できる生命情報生命情報生命情報生命情報生命情報配列解析配列解析配列解析配列解析配列解析動的計画法動的計画法動的計画法動的計画法動的計画法隠れマルコフモデル隠れマルコフモデル隠れマルコフモデル隠れマルコフモデル隠れマルコフモデルアナログ・シミュレーションアナログ・シミュレーションアナログ・シミュレーションアナログ・シミュレーションアナログ・シミュレーションデジタル・シミュレーションデジタル・シミュレーションデジタル・シミュレーションデジタル・シミュレーションデジタル・シミュレーション特になし特になし特になし特になし特になし配列アラインメント\r\n　－経路探索問題，動的計画法，大域的配列アラインメント, 局所的配列アラインメント動的計画法による大域的および局所的配列アラインメントの計算多重配列アラインメント\r\n　－多重アラインメントの計算量，ヒューリスティックな手法スター法やツリーベース法による多重配列アラインメントの計算進化系統樹推定\r\n　－距離行列法，形質状態法，系統樹の確からしさUPGMA法やNJ法による進化系統樹の計算データベースからの相同性検索\r\n　－アミノ酸置換行列，ヒットの有意性，e値，ビットスコア，p値データベース検索におけるヒットのe値およびp値の計算\t相同性検索の高速化\r\n　－FASTA，BLAST，and PSI-BLAST探索表による部分文字列の高速検索モチーフの表現と抽出\r\n　－正規表現，プロファイル行列，隠れマルコフモデルモチーフ配列の各種モデルによる表現法の理解タンパク質の構造解析\r\n　－二次構造，三次構造，分子シミュレーションタンパク質の二次構造・三次構造および解析手法に関する理解細胞システムのアナログ・シミュレーション (1)各授業で示す細胞システムのアナログ・シミュレーション (2)各授業で示す細胞システムのアナログ・シミュレーション (3)各授業で示す細胞システムのデジタル・シミュレーション (1)各授業で示す細胞システムのデジタル・シミュレーション (2)各授業で示す細胞システムのデジタル・シミュレーション (3)各授業で示す生命シミュレーションに関する発展的話題各授業で示す",
    "CSC.T378": "チーム開発集中演習基礎チーム開発集中演習基礎チーム開発集中演習基礎チーム開発集中演習基礎チーム開発集中演習基礎チーム開発集中演習基礎チーム開発集中演習基礎"
}